Documents/Публикация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Публикация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Авторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Каналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Публикация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура Отметить(Ссылка)
	Док = Ссылка.ПолучитьОбъект();
	Док.ПометкаУдаления	= Ложь;
	Док.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстПолучить(Знач Ссылка)
	Возврат ?(ПустаяСтрока(Ссылка.ТекстСтатьи), Ссылка.Описание, Ссылка.ТекстСтатьи);
КонецФункции

&НаСервере
Процедура ТекстУстановить(Знач Ссылка)
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация") Тогда
		Содержание.Удалить();
		Содержание.УстановитьHTML(Инфостарт.Причесать(ТекстПолучить(Ссылка)), Новый Структура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина;
	Иначе
		ТекстУстановить(Объект.Ссылка);
	КонецЕсли;
	ВремяСтарт	= ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если НЕ Объект.Проведен И ТекущаяДата() - ВремяСтарт > ОтметитьКакПрочтенноеЧерезСек() Тогда
		Отметить(Объект.Ссылка);
		Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
			ВладелецФормы.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НаКлиенте.ОткрытьПоСсылке(Объект.Гиперссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ТекстУстановить(Параметр);
КонецПроцедуры

&НаСервере
Функция ОтметитьКакПрочтенноеЧерезСек()
	Возврат Регламент.ОтметитьКакПрочтенноеЧерезСек();
КонецФункции
